# SetAdditionalElement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..SetAdditionalElement Method
FailureMessage Class See Also
---
Sets the additional reference element for the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureMessage SetAdditionalElement(
	ElementId additionalElement
)
```

Visual Basic
---
```text
Public Function SetAdditionalElement ( _
	additionalElement As ElementId _
) As FailureMessage
```

Visual C++
---
```text
public:
FailureMessage^ SetAdditionalElement(
	ElementId^ additionalElement
)
```

# ### Parameters
additionalElement
    Type: Autodesk.Revit.DB..::..ElementId The additional element.
# ### Return Value
The FailureMessage.
# Remarks
Additional elements are used to highlight additional information to the user. They are not considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessage is already posted to a document |

# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace